#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.redis_messages.azurerm_private_endpoint.this[0] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-msgs-redis-01-private-endpoint" -> (known after apply)
        name                          = "io-p-itn-msgs-redis-01-private-endpoint"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/networkInterfaces/io-p-itn-msgs-redis-01-private-endpoint.nic.176907d5-d7ba-49b2-a79f-565ad5ad7f45"
              - name = "io-p-itn-msgs-redis-01-private-endpoint.nic.176907d5-d7ba-49b2-a79f-565ad5ad7f45"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-msgs-redis-01-private-endpoint/privateDnsZoneGroups/io-p-itn-msgs-redis-01-private-dns-zone-group/privateDnsZoneConfigs/privatelink.redis.cache.windows.net"
              - name                = "privatelink.redis.cache.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "io-p-itn-msgs-redis-01.privatelink.redis.cache.windows.net"
                      - ip_addresses = [
                          - "10.20.2.26",
                        ]
                      - name         = "io-p-itn-msgs-redis-01"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-msgs-redis-01-private-endpoint/privateDnsZoneGroups/io-p-itn-msgs-redis-01-private-dns-zone-group" -> (known after apply)
            name                 = "io-p-itn-msgs-redis-01-private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "io-p-itn-msgs-redis-01-private-service-connection"
          ~ private_connection_resource_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Cache/redis/io-p-itn-msgs-redis-01" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.20.2.26" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.redis_messages.azurerm_redis_cache.this must be replaced
-/+ resource "azurerm_redis_cache" "this" {
      ~ capacity                           = 1 -> 2
      ~ family                             = "P" -> "C"
      ~ hostname                           = "io-p-itn-msgs-redis-01.redis.cache.windows.net" -> (known after apply)
      ~ id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Cache/redis/io-p-itn-msgs-redis-01" -> (known after apply)
        name                               = "io-p-itn-msgs-redis-01"
      ~ port                               = 6379 -> (known after apply)
      ~ primary_access_key                 = (sensitive value)
      ~ primary_connection_string          = (sensitive value)
      + private_static_ip_address          = (known after apply)
      ~ redis_version                      = "6.0" -> "6"
      ~ replicas_per_master                = 1 -> (known after apply)
      ~ replicas_per_primary               = 1 -> (known after apply)
      ~ secondary_access_key               = (sensitive value)
      ~ secondary_connection_string        = (sensitive value)
      - shard_count                        = 0 -> null
      ~ sku_name                           = "Premium" -> "Standard" # forces replacement
      ~ ssl_port                           = 6380 -> (known after apply)
        tags                               = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      - tenant_settings                    = {} -> null
      - zones                              = [ # forces replacement
          - "1",
          - "2",
        ] -> null
        # (7 unchanged attributes hidden)

      ~ redis_configuration {
          - active_directory_authentication_enabled = false -> null
          - aof_backup_enabled                      = false -> null
          ~ maxclients                              = 7500 -> (known after apply)
          ~ maxfragmentationmemory_reserved         = 642 -> (known after apply)
          ~ maxmemory_delta                         = 642 -> (known after apply)
          ~ maxmemory_reserved                      = 642 -> (known after apply)
          - rdb_backup_frequency                    = 0 -> null
          - rdb_backup_max_snapshot_count           = 0 -> null
            # (9 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.web_apps.azurerm_redis_cache_access_policy_assignment.etl_func_redis_access_policy must be replaced
-/+ resource "azurerm_redis_cache_access_policy_assignment" "etl_func_redis_access_policy" {
      ~ id                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Cache/redis/io-p-itn-msgs-redis-01/accessPolicyAssignments/etl_func" -> (known after apply)
        name               = "etl_func"
      ~ redis_cache_id     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Cache/redis/io-p-itn-msgs-redis-01" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01"
        name                                           = "io-p-itn-msgs-sending-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ sticky_settings {
          ~ app_setting_names       = [
              - "APPINSIGHTS_SAMPLING_PERCENTAGE",
                "SLOT_TASK_HUBNAME",
                "AzureFunctionsJobHost__extensions__durableTask__hubName",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
                "AzureFunctionsWebHost__hostid",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (30 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.web_apps.module.citizen_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-citizen-func-01"
        name                                           = "io-p-itn-com-citizen-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.web_apps.module.citizen_func.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-citizen-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (30 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.web_apps.module.citizen_func.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-com-citizen-func-01] Health Check Failed"
        name                     = "io-p-itn-com-citizen-func-01] Health Check Failed"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.web_apps.module.etl_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-etl-func-01"
        name                                           = "io-p-itn-com-etl-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.web_apps.module.etl_func.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-etl-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (30 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 7 to change, 3 to destroy.

Warning: Argument is deprecated

  with module.storage_api_weu.azurerm_storage_container.message_content,
  on ../_modules/storage_accounts/storage_account_api.tf line 32, in resource "azurerm_storage_container" "message_content":
  32:   storage_account_name  = module.storage_api.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
